In [17]:
import pandas as pd
import numpy as np

#Criando um dicionário de Séries
d = {'Nomes':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Idade':pd.Series([25,26,25,30,29,23,34,30,51,46]),
   'Qualidade':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65]),
   'Projetos':pd.Series([4,3,3,2,3,4,3,3,2,4,45,3]),
    }

#Criando um DataFrame
df = pd.DataFrame(d)
print(df)

    Idade   Nomes  Projetos  Qualidade
0    25.0     Tom         4       4.23
1    26.0   James         3       3.24
2    25.0   Ricky         3       3.98
3    30.0     Vin         2       2.56
4    29.0   Steve         3       3.20
5    23.0   Smith         4       4.60
6    34.0    Jack         3       3.80
7    30.0     Lee         3       3.78
8    51.0   David         2       2.98
9    46.0  Gasper         4       4.80
10    NaN  Betina        45       4.10
11    NaN  Andres         3       3.65

In [18]:
df.sum() #somatório dos valores dos campos

Idade                                                      319
Nomes        TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Projetos                                                    79
Qualidade                                                44.92
dtype: object

In [21]:
df.mean() #média dos campos numéricos

Idade        31.900000
Projetos      6.583333
Qualidade     3.743333
dtype: float64

In [22]:
df.mode() #Calculanado a Moda

    Idade   Nomes  Projetos  Qualidade
0    25.0  Andres       3.0       2.56
1    30.0  Betina       NaN       2.98
2     NaN   David       NaN       3.20
3     NaN  Gasper       NaN       3.24
4     NaN    Jack       NaN       3.65
5     NaN   James       NaN       3.78
6     NaN     Lee       NaN       3.80
7     NaN   Ricky       NaN       3.98
8     NaN   Smith       NaN       4.10
9     NaN   Steve       NaN       4.23
10    NaN     Tom       NaN       4.60
11    NaN     Vin       NaN       4.80

In [23]:
df.count() #A idade tem menos que as outras colunas, tendo campos vazios.

Idade        10
Nomes        12
Projetos     12
Qualidade    12
dtype: int64

In [25]:
#Contando a quantidade por valor, e, também dos valores NaN
dfv = df['Idade'].value_counts(dropna=False) 
print(dfv)

NaN      2
 30.0    2
 25.0    2
 46.0    1
 51.0    1
 34.0    1
 23.0    1
 29.0    1
 26.0    1
Name: Idade, dtype: int64

In [26]:
df.corr() #correlação

              Idade  Projetos  Qualidade
Idade      1.000000 -0.303218  -0.089589
Projetos  -0.303218  1.000000   0.219165
Qualidade -0.089589  0.219165   1.000000

In [27]:
df.head(n=5) # 5 primeiros registros

   Idade  Nomes  Projetos  Qualidade
0   25.0    Tom         4       4.23
1   26.0  James         3       3.24
2   25.0  Ricky         3       3.98
3   30.0    Vin         2       2.56
4   29.0  Steve         3       3.20

In [28]:
df.tail(n=5) # 5 últimos registros

    Idade   Nomes  Projetos  Qualidade
7    30.0     Lee         3       3.78
8    51.0   David         2       2.98
9    46.0  Gasper         4       4.80
10    NaN  Betina        45       4.10
11    NaN  Andres         3       3.65

In [29]:
df['Idade'].describe() #descrevendo uma coluna

count    10.00000
mean     31.90000
std       9.38616
min      23.00000
25%      25.25000
50%      29.50000
75%      33.00000
max      51.00000
Name: Idade, dtype: float64